{"pages":[{"title":"关于我是谁","text":"关于我是谁？为什么要做这个博客？","link":"/about/index.html"},{"title":"文章分类","text":"","link":"/categories/index.html"}],"posts":[{"title":"100个司机被google地图导航带入泥泞田野里","text":"100个司机被google地图导航带入泥泞田野里 （CNN）技术并非总能做到万无一失，因为大约100名科罗拉多州的驾驶员在Google Maps为他们提供了一种避免交通拥堵的捷径时就学到了。 通往丹佛国际机场的道路PeñaBoulevard发生车祸，促使该应用在周日绕道行驶。 但这真是太好了。 替代路线将驾驶员带到一条土路上，雨已变成泥泞的烂摊子，汽车开始四处行驶。 有些车辆无法通过泥泞，约有100辆其他车辆被困在车后。","link":"/2019/10/31/100%E4%B8%AA%E5%8F%B8%E6%9C%BA%E8%A2%ABgoogle%E5%9C%B0%E5%9B%BE%E5%AF%BC%E8%88%AA%E5%B8%A6%E5%85%A5%E6%B3%A5%E6%B3%9E%E7%94%B0%E9%87%8E%E9%87%8C/"},{"title":"世界上最古老的树生长在瑞典","text":"世界上最古老的树生长在瑞典 世界上最古老的树Old Tjikko是一棵拥有9500年历史的挪威云杉树，由Leif Kullman教授于2004年发现，至今仍是世界上最古老的树。这棵树位于达拉纳省的Fulufjället。 于默奥大学自然地理学教授库尔曼（Kullman）以他的西伯利亚哈士奇犬的名字命名了这棵树，并使用carbon-14方法发现了树的年龄。","link":"/2019/10/31/%E4%B8%96%E7%95%8C%E4%B8%8A%E6%9C%80%E5%8F%A4%E8%80%81%E7%9A%84%E6%A0%91%E7%94%9F%E9%95%BF%E5%9C%A8%E7%91%9E%E5%85%B8/"},{"title":"世界发生了什么：2019.11月第一周","text":"有一句安慰是：比上不足，比下有余。但这句话其实安慰不了人。只要常常存着跟人比较的心，就永远不会快乐。 蔡康永 Instagram Show 这个博客专栏的大部分文章都来自国外的网站，点击标题可以跳转到原文链接，国内用户会被墙，无法访问。 如果你真的想看完整的原文链接，可以留言告诉我，我可以把该网页另存为本地html网页格式，然后回复给你，这样你就可以打开看了。 博客文摘 1、科学家用筛网从雾气中收集水资源雾是地面上非常低的云，由小水滴或冰晶组成的水汽凝结物。 美国的几个科学家发明了一种筛网形状的收集器，它垂直于地面立起来，当风把雾气吹过筛网时，筛网会捕捉到雾里的水滴，水滴在重力的作用下会流入下面的容器里。大多数情况下，每平方米的筛网每天可以收集约三升水。 不得不说，对于那些在干旱偏远、靠近海岸地区生活的人们来说，这种收集器还是十分有用的。 2、考古学家发现了史前文明里的婴儿“奶瓶”考古学家在德国发掘了一个坟墓，在里面发现了一些外形奇怪的陶瓷土瓶，最早可以追溯到公元前1200年。在瓶内发现了古老的食物痕迹，其成分与牛奶、羊奶十分接近。考古学家推测这种容器是用来喂养儿童或者病人的。 3、苹果公司的第一个Logo1976年，苹果公司成立时的第一个 Logo，是牛顿坐在苹果树下面。 很快，乔布斯就用咬了一口的苹果，取代了这个 Logo。 4、世界上最古老的树生活在瑞典世界上最古老的树是一棵拥有9500年历史的挪威云杉树，由Leif Kullman教授于2004年发现，至今仍是世界上最古老的树。这棵树位于瑞典的达拉纳省。 5、大多数美国奶牛都来自于两头公牛美国奶牛农场是依靠人工授精的方式来繁殖奶牛的，农场都会购买优质公牛的精液，因此有专门的养殖公牛、出售优质精液的公司。 有研究者对此做了深入研究，结果发现了一个令人震惊的结果：那些提供精液的优质公牛的祖先，可以追溯到到1950年代和1960年代出生的两只公牛 。 6、材料技术的新突破：在水中不会下沉的金属美国罗切斯特大学的研究人员开发出了新的结构技术，可以浮在水面上的金属。他们从水蜘蛛和火蚁浮在水面上，获得启发。 这项技术暂时还是停留在实验室阶段，但至少已经实验成功了。如果能够普及的话，那么可以用于轮船制造的革新，还有海洋里的监控设备，用于水中的可穿戴电子设备。 7、一个新的社交媒体APP现在的社交类的软件太多了，简直是乱花渐欲迷人眼。最近在纽约出现了一个新的社交应用APP：Friended。它既不是小视频类型的，也不是交友类型的。它的玩法看起来有点像以前的贴吧，但又不全是。 你在APP上发表某个想法或感受，然后社区成员看到后，不能直接在帖子下方回复。而是另外单独一对一和你回复。 目前为止，据说这个APP注册用户已经达到了50万。有兴趣可以玩一玩。 8、为什么旧时代的欧洲贵族会恐惧西红柿在1700年代后期，大部分欧洲人都害怕吃番茄，将它称为“毒苹果”。 因为人们认为贵族们在进食西红柿后生病并死亡，但事实是富裕的欧洲人使用铅含量高的锡制盘子。 由于西红柿的酸度很高，当将其放在这种特殊的餐具上时，盘子中的铅会被浸泡出来，导致人们铅中毒死亡。所以，西红柿被认为是罪魁祸首。 9、珍贵罕见的老照片：马克·吐温在特斯拉的实验室玩电1894年春天，文学巨匠马克·吐温在伟大发明家尼古拉·特斯拉的实验室里。 10、澳大利亚开始流行数字驾驶证在澳大利亚的新南威尔士州，数字驾驶证已经可以合法使用。警察查车时，拿出手机，打开你的驾驶证页面就可以了，这很方便。 这周世界发生了什么？ 1、Facebook发布了新logo在本周一，世界社交网络巨头公司Facebook发布了它的新logo。其实也没有大的变化，仍然是”Facebook”这个单词，相比于原来的蓝底白字的静态logo，这个新logo的变化在于，它是一个动态图了，”Facebook”这个单词字体的颜色循环在“红”、“绿”、“蓝”三种颜色之间渐变。 “红”色代表了Instagram公司，“绿色”是代表了 WhatsApp 公司，“蓝”色代表Facebook自己。这样修改的原因是为了强调，Facebook收购了Instagram公司、WhatsApp 公司，Facebook同时拥有这两家优秀的互联网科技公司。 2、Facebook、Google、Snapchat三方“围剿”抖音海外版tiktok抖音这款应用是北京的“字节跳动”公司发布的，它在国内无疑是非常成功的。在2017年“字节跳动”又发布了抖音的海外版，取名叫“TikTok”。 我下载过tiktok，但它好像屏蔽了国内用户，APP打开后，没有任何小视频显示，点击注册也会失败。如果你真的想玩TikTok，也不是没有办法，有破解版本可以安装的。 TikTok在国外非常受欢迎，在一年时间里，下载次数达到7.5亿次，甚至超过了社交网络巨头公司Facebook、YouTube。 因此，TikTok越来越遭遇竞争对手的打压，但是好像没有明显的效果，美国官方都开始介入了。 3、google地图导航又出错了我的印象中，Google地图导航出错，好像不只一两回了。这次google地图导航把100多个司机带入了田野的泥泞里。 4、美国又发现物种入侵：亚洲黑鱼黑鱼， 是乌鳢[lǐ]的俗称。对于国内人们来说，这种鱼很常见，而且还很美味。但是，这种鱼性格凶猛，甚至吃其他小鱼。不知是怎么进入美国的河流湖泊的，开始大规模的繁殖，对当地生态系统造成了不小的破坏。政府呼吁人们，只要见到这种鱼，直接杀死。这是继亚洲鲤鱼之后的又一种亚洲鱼类入侵美国了。 5、日本女学生用古代忍术写论文日本有一个女大学生对忍术历史很感兴趣，在大一学期时，参加了忍者历史的课程。课程结束后，需要上交论文，她灵机一动，用忍术里的隐形墨水来写论文，在纸上写好论文，墨水变干后，字迹就会消失不见。 他的教授看到论文时，一开始很疑惑，怎么是一张空白的纸呢？后来他猜想可能是隐形墨水，就把纸拿去火上烤了一会，然后字迹就出现了。他对这个创意大为赞叹，于是给了这个女孩的论文满分。 6、互联网诞生50周年50年前，也就是1969年10月29日晚上，在加州大学洛杉矶分校一幢叫做Boelter Hall的大楼里，在大楼三层的3402室，一位名叫Charley Kline的研究生，坐在ITT电传打字机终端前，第一次把数字数据传输发送给了Bill Duvall，他当时正坐在加利福尼亚另一边的斯坦福研究所的另一台计算机前面。 这标志着互联网的诞生。 为了表示纪念，那个3402室仍然以当时的样子继续保留着。 7、YouTube正在封禁破解教程一类的视频YouTube这一新规定引起了不小的震动，国外的论坛上对此有大量的讨论。因为YouTube上有大量的这种教人怎么破解软件的教程频道，而且粉丝数量众多。这么一来，很多频道会无法生存的。 8、 旧金山 三分之一的居民表示想离开，生活成本太高国内有逃离北上广深一说，原来国外也有。最近的民意调查，旧金山有三分之一的居民想离开。因为这里的生活成本太高了，高昂的房租尤其突出。 你不知道的冷门历史 二维码的来历二维码，也叫QR码，英语是Quick Response Code。于1994年由日本的DENSO WAVE公司发明，最初设计二维码的原因竟然是为了方便超市的收银员。 当时超市使用的现金收款机，要靠手动输入商品的价格，因此负责现金收款的人，常常会因手腕的麻木和“腱鞘炎”而苦恼。 条形码的出现解决了这一苦恼。由于POS系统的成功开发，仅通过光感读取条形码，价格就会自动显示在收款机上，同时读取的商品信息还能传送到计算机上。如此一来，条形码得以普及。但新的问题又随之而来，问题在于条形码的容量有限，英文数字最多只能容纳20个字。 在这一背景下，DENSO WAVE公司的研发小组怀着“一定要满足客户需求”的心愿，投入到了新的二维码的研发之中。当时的研发小组一共也只有两个人，负责人叫原昌宏。 研发小组面临的最大课题，是如何实现高速读取。有一天，原昌宏的脑海里浮现出这样一个思路：“附上’此处有编码’这样的位置信息会怎样？” 于是想到的是四角形的“定位图案”。将这一图形放入二维码中，便可实现其他公司无法模仿的高速读取。 研发项目启动后经过一年半的时间，在经历了几多曲折之后，可容纳约7000个数字的二维码终于诞生了。其特点是能进行汉字处理，大容量，而且读取速度比其他编码快10倍以上。 优质长文 我的哈佛求学之路北大的保安考取研究生，这种新闻正是艰难环境下求学故事的一个典型例子。在国外，也有类似的故事，本文讲述了美国一个退役军人通过自己的努力，考入哈佛大学的故事，主人公不是什么天才，而且他还是个黑人，值得一看。与此类似的，我还想起了十几年前有一部根据真实故事改编的电影，叫《风雨哈佛路》，主人公的名字叫” Liz Murray “。 多写，少看 这是一篇 1600 字的文章。作者花了一个月的时间写完。为什么写得这么慢？因为是在上下班公交车上，用手机上写的。作者认为，与其被动地接受别人推给你的内容，不如每天一点一点地创作自己的内容。 一天读一句小说不是用机器制作出来的，写小说通常都没有什么一定的规格和程序。有时候是先有故事才有人物，因为要编织一个故事的情节而制造出一些人物来；有时候却是先有人物才有故事，先想到了一个性格突出的人物，因为这个人物的性格思想行为，而产生故事。 古龙 一周一本书《从文自传》 很多人都知道沈从文的中篇小说《边城》，我看了之后就想去凤凰风景区看一看，不过应该很难领略到《边城》里的原汁原味了，因为如今的景区商业化太浓了。 但我今天要推荐的是沈从文的自传散文集《从文自传》，描写了他小时候上学的事，后来又加入革命军的事，一直写到他孤身一人前往北京。语言平实，饱含深情，又十分有趣，作者对于细节的描写，十分具有带入感。 顺带提一句，沈从文的情书写的非常好，有兴趣可以看看他写给张兆和的情书，那叫一个“润物细无声”。 i-movie1、新鲜番茄《最高通缉犯》 “烂番茄”影评网番茄新鲜度87% 影片故事发生在德国汉堡，影片围绕一个受伤了的神秘男子展开，涉及到间谍、悬疑、反转。 2、烂番茄《好女孩》 “烂番茄”影评网番茄新鲜度19% 两个女孩爱上同一个男孩，俗套的故事，既不浪漫，也不惊喜，也不清新文艺，也不动人。非要说亮点的话，就是女主角十分养眼，有“猩红女巫”。 3、即将上映《格兰德岛》 尼古拉斯·凯奇的新作，影片题材是惊悚、犯罪类型。凯叔很久没露面了，希望这次作品不要烂。北美上映时间是2019.12.06，国内时间暂时未知。","link":"/2019/11/08/%E4%B8%96%E7%95%8C%E5%8F%91%E7%94%9F%E4%BA%86%E4%BB%80%E4%B9%88%EF%BC%9A2019-11%E6%9C%88%E7%AC%AC%E4%B8%80%E5%91%A8/"},{"title":"世界发生了什么：2019-11月第二周","text":"耐心和持久，胜过激烈和狂热，不管环境变换到何种地步，只有初衷与希望永不改变的人，才能最终克服困难，达到目的。 儒勒·凡尔纳《海底两万里》 Instagram Show 这个博客专栏主要是收罗了国外各种优质博客内容，点击标题可以跳转到原文链接，国内用户会被墙，无法访问。 如果你真的想看完整的原文链接，可以留言告诉我，我把该网页另存为本地html网页格式，然后回复给你，这样你就可以打开看了。 博客文摘 1、在维也纳森林里寻找炸弹维也纳的一名远足爱好者，在当地的一个森林里发现了一些成堆的旧金属，仔细看过才发现原来是一些陈旧的炸弹，军用杯子。 图中最左侧的弹头，其实一种反坦克弹药，历史上真实的样子是这样的： 他拍下照片，发到推特上，很快就有拆弹警察来处理了。 第二次世界大战结束时，维也纳被盟军占领，德国的国防军被迫退入森林里，这些炸弹应该就是他们留下的。到现在仍然可以在森林里发现一些装满炸弹的板条木箱。 2、一座真实存在的鬼宅如果你对鬼宅一类的传说故事有兴趣，那么这篇文章你可以读一读。 这座鬼宅是位于洛杉矶的一座别墅，现在仍然存在，但已经禁止进入，去那里看过的人都说，那宅子充满着诡异和阴森。 1959年，住在这里的一家人发生了恐怖的凶案，丈夫用锤子十分从容地把妻子、女儿杀害，然后自杀未遂。至今留下很多疑点和传说，是美国有名的鬼宅。 3、怎么用手机制作自己的动画电影先在手机安装一个定格动画编辑器，比如Stop Motion Studio 绘制镜头，设计场景，同样可以借用画板应用工具 固定手机，打开相机，捕捉镜头 开始动画制作，拍一张照片，然后改变动画角色模型位置，再拍第二张照片，以此类推。通常，一秒的镜头需要准备10-12张照片 编辑、整理照片，剪辑影片 欣赏影片 4、让学生自己捣腾台式电脑一个教计算机课程的大学老师，他觉得理论课程让学生十分乏味。于是他主张让学生自己动手做点不一样的东西，他让学生对台式电脑做各种“捣腾”。结果就成了这样： 加装LED灯 做“吃豆人”贴纸 最后的样子 5、在硅谷的机器人咖啡厅美国硅谷有一家机器人咖啡厅，它属于一家初创公司的产品，而且还拿到了不少的风投资金。 这个机器人咖啡厅看起来科技感超强，深受年轻人欢迎，取名叫：CafeX，不知道味道如何： 这周世界发生了什么？ 1、时隔63年的轻吻这是一场等待半个世纪的婚礼，挚诚的夕阳恋情。 1956年，美国俄亥俄州的一个年轻小伙，在一次高中学校的舞会上，认识了一个漂亮的女孩。当时小伙就被女孩深深吸引了，并且认为自己100%爱上了她。 但是，在那之后，因为种种原因，小伙再也没能见到女孩，高中毕业后就各奔东西了。 但是在去年夏天，他们居然又偶然重逢。这时候小伙已经80岁，女孩也已经80岁。小伙果断向女孩表达了心中的爱。最近，他们在教堂举行了婚礼。小伙对女孩说：“不管你喜不喜欢，我都会吻你。” 这一吻，等了63年。 2、法国：日渐消失的传统面包作坊法国的传统面包作坊，伴随了上一代人的成长。如今的法国年轻人，越来越习惯到商场或者连锁店购买面包，乡村地区的老式传统面包店已经门庭冷清，除了年纪大的老顾客还会光顾。因此，这种面包店正在逐年关闭，越来越少了。 但是，乡村里的面包店关闭了，给那里生活的老人又带来不方便。于是，在路边会看到自助式的面包售卖机。 3、加拿大的魁北克省歧视法国女人魁北克省，是加拿大的第一大省。这里好像对法国妇女有歧视眼光，最近，一名法国妇女申请魁北克省的永久居留权，却屡屡被拒绝，官方给的理由竟然是说她的法语水平不够。这个理由简直了，只能说欲加之罪，何患无辞呢？ 4、VR技术应用到房地产行业得益于硬件的飞速发展，比如360度摄像头，功能强大的芯片。现在房地产也开始采用VR技术，只需要把房子的设计图纸交给VR设备，就可以在建筑工地实时构建出房子竣工后的样子。 5、两名黑客成功入侵了Amazon Echo，获得了6万美元奖金Amazon Echo，是由亚马逊公司研制的智能音箱，大受用户追捧 在某黑客大赛里，两名黑客测试出了该智能音箱的安全漏洞，可以使音箱连接到恶意Wi-Fi热点，从而完全控制该设备。凭借这个成绩，他俩获得黑客大赛的冠军，获得了6万美元奖金。 6、44岁华人参选2020年美国总统2020美国总统参选人有一个44岁的华人，名叫杨安泽（Andrew Yang） 他是美国历史上第二个参选总统的华人，第一个是1964年的一个夏威夷华人。他这次参选的主打政策是：“只要他当选美国总统，年满18岁的美国公民，每人每月可以从政府领取1000美元，没有任何前提条件。” 7、外科医生首次将猪皮移植到人类身上波士顿的一家生物技术公司，成功将转基因微型猪的猪皮移植到了5名烧伤患者身上 这种猪是专门养殖的，是经过基因改造的，可以防止移植排斥。 8、二战时美国一艘消失成谜的潜艇，最近在日本冲绳岛被发现二战结束后，美国海军对外宣布一共有52艘潜艇消失成谜。一位海底探险家设立了“失落的52号”项目，专门寻找二战中消失的美国潜艇。 最近，他在日本冲绳岛发现了一艘。 你不知道的冷门故事 IT领域里软件Bug一词的由来在IT领域里，对程序员来说，排除程序代码里的潜在缺陷和错误，这一行为俗称“找bug”。 但是为什么这一行为要被称为“找bug”呢，bug的本意是虫子。国外有一篇博客，追根溯源地做了详细的介绍，下面是我提炼后的主要内容。 程序代码的bug，这在IT术语里无处不在，但是这个词是来自何处呢？给人的印象，总觉得是电脑和软件发明以后，才出现了bug这一个说法。但其实bug这个词的使用可以追溯到更早时候，bug一词的起源和历史足以令人惊讶、令人着迷。 bug用来描述缺陷和错误的用法可以追溯到1843年。 历史上第一个程序员——英国人、阿达·洛芙莱斯，在一次给朋友的书信里就用到了bug一词，她指出了一个引擎机器里的故障原因，她在信里就是用bug来描述这个故障的。 后来在1878年，爱迪生给一位合伙人的书信里，也用了bug一词来描述机器设备里的故障。 爱迪生后来的传记也表明，“ bug”一词经常出现在他的笔记本中。 很令人吃惊吧，一开始bug是用来描述机械系统里的故障的。还举一个有趣的例子，1931年，美国流行一种机械弹球游戏：Baffle Ball，该游戏自豪地宣称“此游戏中没有问题！(no bugs in this game)”。 那么，bug又是怎么引用到IT领域来的呢？这就要提到计算机历史上比较有名的“第一个计算机bug”的趣事了。 1947年9月9日，计算机科学家Grace Hopper报告了世界上第一个计算机bug。但是导致故障的原因并不是程序本身问题，而是一只飞蛾虫子。 飞蛾被室内的灯光和计算机散发的热量吸引，最后飞蛾落在了计算机的某个继电器面板上，导致计算机出了故障。 Grace Hopper仔细地除去了飞蛾，并将其贴在日志上，并创造了计算机bug一词。从此以后，bug就变成了一个IT术语，描述程序中的任何错误或故障。 是不是觉得很有趣，第一个计算机bug是由真正的虫子引发的。 优质长文 我逃亡的十年这是一个美国底层平民黑人的故事，特别之处在于，他被指控了多项罪名，有长达十年的逃犯生涯。在这期间，他在母亲、前女友的感化和帮助下，他主动向法官自首。而法官感念他这十年里的改过自新，对他做了从轻发落。他的故事在当地感动了很多人，甚至有导演给他做纪录片，叫《Waymond Hall的投降》，将在2020年发行。 一天读一句我的长处是明白清楚，短处是浅显。那时候我还不满十五岁。二十五年来，我抱定一个宗旨，做文字必须要叫人懂得，所以我从来不怕人笑我的文字浅显。 胡适《四十自述》 一周一本书《这才是中国最好的语文书》 本书是一部长篇合集，收录了大量民国以来文学大师的散文作品。有怀念亲人的，有回忆朋友的，有重新解读经典的，有分享写作技巧的，有对人性思考的，有对历史感悟的。 如果是还在中学的童鞋，这本书可以当成你作文的工具书。对于上班族，这本书绝对是乘坐地铁与公交时的好朋友，抛弃那些喧嚣、低俗的短视频软件，看看这本书的文章，能获取心底的平静，变得有内涵。 i-movie1、新鲜番茄《神父有难》 “烂番茄”影评网番茄新鲜度90% 这部影片拿奖拿到手软，“烂番茄”评分到了90%，少见啊。国外对于这种有关宗教、信仰、世人的题材的影片，好像是会有更多共鸣。影片中的神父希望唤起人性的良知，情愿牺牲自己的生命。 2、烂番茄《迫害》 “烂番茄”影评网番茄新鲜度0% 是的，你没有看错，“烂番茄”给的评分是0%。这片得有多烂啊。 3、即将上映《决战中途岛》 有段时间没有看二战题材的电影了，上一次是《血战钢锯岭》。估计这次的也不错，热血沸腾一把。2019.11.08已经上映。","link":"/2019/11/20/%E4%B8%96%E7%95%8C%E5%8F%91%E7%94%9F%E4%BA%86%E4%BB%80%E4%B9%88%EF%BC%9A2019-11%E6%9C%88%E7%AC%AC%E4%BA%8C%E5%91%A8/"}],"tags":[],"categories":[{"name":"资讯与文摘","slug":"资讯与文摘","link":"/categories/%E8%B5%84%E8%AE%AF%E4%B8%8E%E6%96%87%E6%91%98/"},{"name":"博客文摘","slug":"博客文摘","link":"/categories/%E5%8D%9A%E5%AE%A2%E6%96%87%E6%91%98/"}]}